# D2 data wrangling

## due dates

- A1: this friday (April 19)
- D2: next monday (April 22)
- Q3: next monday (April 22)

## code fix of D2

in the third code cell

change `pd.set_option('precision', 2)` to `pd.set_option('display.precision', 2)`

## data wrangling

Data wrangling deals with several functionalities:
1. **Data exploration**: In this process, the data is studied, analyzed and understood by visualizing representations of data.
2. **Dealing with missing values**: Most of the datasets having a vast amount of data contain missing values of NaN, they are needed to be taken care of by replacing them with mean, mode, the most frequent value of the column or simply by dropping the row having a NaN value.
3. **Reshaping data**: In this process, data is manipulated according to the requirements, where new data can be added or pre-existing data can be modified.
4. **Filtering data**: Some times datasets are comprised of unwanted rows or columns which are required to be removed or filteredâ€¨

### pandas and numpy

| pandas    | numpy |
| -------- | ------- |
| When we have to work on Tabular data, we prefer the pandas module. | When we have to work on Numerical data, we prefer the NumPy module. |
| Pandas have a 2D table object called DataFrame. | Numpy is capable of providing multi-dimensional arrays. |
| The powerful tools of pandas are DataFrame and Series. | the powerful tool of NumPy is Arrays. | 
|  Pandas consume more memory. | Numpy is memory efficient. |
| Indexing of the Pandas series is very slow as compared to Numpy arrays. | Indexing of Numpy arrays is very fast. |

> https://www.geeksforgeeks.org/difference-between-pandas-vs-numpy/

### pandas operations

In [1]:
import pandas as pd

read csv files into a pandas dataframe (df)

In [2]:
data = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/cities.csv')


To explore the data frame:

In [3]:
data.head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

In [4]:
data.describe()

             LatD      "LatM"      "LatS"      "LonD"      "LonM"      "LonS"
count  128.000000  128.000000  128.000000  128.000000  128.000000  128.000000
mean    38.820312   30.765625   27.492188   93.250000   27.742188   26.960938
std      5.200596   16.426158   18.977814   15.466499   16.927937   18.727807
min     26.000000    1.000000    0.000000   71.000000    0.000000    0.000000
25%     35.000000   16.000000   11.000000   80.000000   14.000000   11.000000
50%     39.000000   31.000000   24.000000   89.500000   26.500000   23.500000
75%     42.250000   45.000000   47.000000  103.250000   40.250000   47.000000
max     50.000000   59.000000   59.000000  123.000000   58.000000   59.000000

In [5]:
data.shape

(128, 10)

----------------

locate data inside the dataframe:

data.iloc ( \<row selection\> ), \<column selection\> )

selection can be:  
  - integer list of rows/cols: [0,1,2]          
  -  slice of rows/cols: [4:7]
  - single values: 1

In [6]:
first_row = data.iloc[0] # first row of data frame 

second_row = data.iloc[1] # second row of data frame 

last_row = data.iloc[-1] # last row of data frame 

first_col = data.iloc[:,0] # first column of data frame

second_col = data.iloc[:,1] # second column of data frame

In [7]:
first_row

LatD                   41
 "LatM"                 5
 "LatS"                59
 "NS"                 "N"
 "LonD"                80
 "LonM"                39
 "LonS"                 0
 "EW"                 "W"
 "City"      "Youngstown"
 "State"               OH
Name: 0, dtype: object

---------------------------

to get the column names of a dataframe:

In [8]:
list(data)

['LatD',
 ' "LatM"',
 ' "LatS"',
 ' "NS"',
 ' "LonD"',
 ' "LonM"',
 ' "LonS"',
 ' "EW"',
 ' "City"',
 ' "State"']

to rename column names:

In [9]:
data.columns = [
    'LatD',
    'LatM',
    'LatS',
    'NS',
    'LonD',
    'LonM',
    'LonS',
    'EW',
    'City',
    'State'
]

In [10]:
list(data)

['LatD', 'LatM', 'LatS', 'NS', 'LonD', 'LonM', 'LonS', 'EW', 'City', 'State']

are they the only way to get names of columns and rename them? try to find other ways!

### data cleaning

`isnull()`

syntax:
- pd.isnull(dataframe)
- dataframe.isnull()

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.isnull.html

In [11]:
data.isnull()

      LatD   LatM   LatS     NS   LonD   LonM   LonS     EW   City  State
0    False  False  False  False  False  False  False  False  False  False
1    False  False  False  False  False  False  False  False  False  False
2    False  False  False  False  False  False  False  False  False  False
3    False  False  False  False  False  False  False  False  False  False
4    False  False  False  False  False  False  False  False  False  False
..     ...    ...    ...    ...    ...    ...    ...    ...    ...    ...
123  False  False  False  False  False  False  False  False  False  False
124  False  False  False  False  False  False  False  False  False  False
125  False  False  False  False  False  False  False  False  False  False
126  False  False  False  False  False  False  False  False  False  False
127  False  False  False  False  False  False  False  False  False  False

[128 rows x 10 columns]

In [13]:
data.isnull().any(axis=1)

0      False
1      False
2      False
3      False
4      False
       ...
123    False
124    False
125    False
126    False
127    False
Length: 128, dtype: bool

In [14]:
data.isnull().any(axis=1).sum()

0

--------

`dropna()`

to drop rows or columns with null values.


Dropping rows and/or columns is generally useful if our data contains a large amount of null values; rows with missing values may not be valuable to us

parameters:
- axis: Determine if rows or columns which contain missing values are removed.
- how: Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.

details: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html

In [15]:
# Drop the rows where all elements are missing.
data = data.dropna(how='all')

-------

`fillna()`


to fill null values in a dataframe.

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html

In [41]:
# Example to fill value with 0s
data = data.fillna(0)